testCases/testPyro2/constant/reactions
species
(
    N2
);

reactions
{

}
